#pragma execution_character_set("utf-8")


#include <chrono>
#include <iomanip>
#include <string>
#include <windows.h>

#include "../include/pch.h"
#include "../include/battle_cat_data.h"

std::string utf8_to_big5(const std::string& utf8) {
    if (utf8.empty()) return "";

    // Step 1: UTF-8 → UTF-16
    int wlen = MultiByteToWideChar(CP_UTF8, 0,
                                   utf8.c_str(), (int)utf8.size(),
                                   nullptr, 0);
    std::wstring wstr(wlen, 0);
    MultiByteToWideChar(CP_UTF8, 0,
                        utf8.c_str(), (int)utf8.size(),
                        &wstr[0], wlen);

    // Step 2: UTF-16 → Big5 (CP950)
    int len = WideCharToMultiByte(950, 0,
                                  wstr.c_str(), (int)wstr.size(),
                                  nullptr, 0, nullptr, nullptr);
    std::string big5(len, 0);
    WideCharToMultiByte(950, 0,
                        wstr.c_str(), (int)wstr.size(),
                        &big5[0], len,
                        nullptr, nullptr);

    return big5;
}

BattleCatData::BattleCatData()
{
    auto start = std::chrono::high_resolution_clock::now();

    idToUnitName = unordered_map<int32_t, string>();
    unitNameToId = unordered_map<string, int32_t>();
    loadUnits();
    loadBanners();

    auto end = std::chrono::high_resolution_clock::now();
    std::chrono::duration<double> elapsed = end - start;
    std::cout << "BattleCatData initialization time: "
              << std::fixed << std::setprecision(4)
              << elapsed.count() << " seconds\n";
}

BattleCatData& BattleCatData::getInstance()
{
    static BattleCatData instance;
    return instance;
}

int32_t BattleCatData::getUnitId(const string &unitName) const {
    std::cout << "Looking up unit ID for: " << unitName << std::endl;
    std::cout.flush();
    auto it = unitNameToId.find(unitName);
    if (it != unitNameToId.end()) {
        return it->second;
    }
    return -1; // Unknown unit
}

//#define _SILENCE_CXX17_CODECVT_HEADER_DEPRECATION_WARNING
//#include <codecvt>
//#include <locale>

unordered_map<int, string> getIdToName()
{
    std::ifstream in("bc-tw.yaml");
    //in.imbue(std::locale(std::locale(), new std::codecvt_utf8<char>));

    unordered_map<int, string> idToName;
    string line;
    int currentId = -1;

    std::regex idRegex(R"(^\s*(\d+):\s*$)");
    std::regex nameRegex(R"(^\s*name:\s\[(.*)\])");

    while (std::getline(in, line)) {
        std::smatch match;
        if (std::regex_match(line, match, idRegex)) {
            currentId = std::stoi(match[1]);
        } else if (std::regex_match(line, match, nameRegex) && currentId != -1) {
            string names = match[1];
            size_t pos = names.find(',');
            string firstName = (pos == string::npos) ? names : names.substr(0, pos);
            // trim spaces
            firstName.erase(0, firstName.find_first_not_of(" \t"));
            firstName.erase(firstName.find_last_not_of(" \t") + 1);
            // idToName[currentId] = firstName;
            idToName[currentId] = utf8_to_big5(firstName);
        }
    }
    return idToName;
}

// TODO: read from file
void BattleCatData::loadBanners()
{
    if (!banners.empty()) return; // Already loaded
    banners = generate_banners(unitNameToId);
    for (const auto& [name, banner] : banners) {
        bannerNames.push_back(name);
        std::cout << "Banner Name: " << name << std::endl;
	}
}

#include <Windows.h>

// TODO: read from file
void BattleCatData::loadUnits()
{
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);
    if (!idToUnitName.empty()) return; // Already loaded
    idToUnitName = getIdToName();
    std::cout << "Loaded " << idToUnitName.size() << " units from file.\n";
    for (const auto& [id, name] : idToUnitName) {
        unitNameToId[name] = id;
    }
}

string BattleCatData::getUnitName(uint32_t unitId) {
    auto it = idToUnitName.find(unitId);
    if (it != idToUnitName.end()) {
        return it->second;
    }
    return "Unknown Unit";
}



std::unordered_map<string, Banner> generate_banners(const unordered_map<string, int32_t>& unitNameToId)
{
    std::unordered_map<string, Banner> banners;

   /* banners["test"] = initBanner(
        {
            {10000, {"test1", "test2", "test3"}, false},
            {0, {}, false},
            {0, {}, false}
        }, unitNameToId);

    banners["2024-07-29 ~ 2024-08-05: 追加新角色！充滿幸福氣氛的期間限定轉蛋「完美新娘」登場★點圖確認詳細吧!!"] = initBanner(
        {
            {7000, {"貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, true},
            {2500, {"遭洗腦的貓咪", "遭洗腦的坦克貓", "遭洗腦的牛貓", "湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {500, {"婚禮蛋糕機器貓", "婚紗異能貓", "祝福神克羅諾絲", "海龍達萊亞薩", "不死女薇薇", "白鶴貓", "前田慶次"}, false}
        }, unitNameToId);

    banners["2024-08-05 ~ 2024-08-19: 共有6位限定角色的「神劍闖江湖」轉蛋登場!★點圖確認詳細吧!!"] = initBanner(
        {
            {7000, {"貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, true},
            {2500, {"小小神谷薰", "小小彌彥", "湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {500, {"緋村劍心", "相樂左之助", "四乃森蒼紫", "齋藤一"}, false}
        }, unitNameToId);

    banners["2024-04-26~2030-01-01:必出超激稀有角色的白金轉蛋!快來獲得心儀的貓咪吧!"] = initBanner(
        {
            {0, {}, false},
            {0, {}, false},
            {10000, {"鐵籠的姵卡薩", "光翼神伊西絲", "鐵精靈卡卿", "建築兵團・運輸隊", "額頭貓", "非命之王佛挪", "閃電傑克", "一寸法師", "命運之子佛諾", "光之女神希莉烏斯", "周遊藝團・雜耍隊", "天狗貓", "海龍達萊亞薩", "悲嘆揮舞孃", "冰精靈布莉茲", "服部半藏", "狩獵女孩媞倫", "墮天神路西法", "歡笑揮舞孃", "白騎士庫克洛普斯", "舌切雀", "超龍戰機・毀滅團", "闇精靈亞米", "怒髮貓", "邪龍赫維賈克", "妖賢女莉莉", "天草四郎", "召喚少年小悟", "貓咪王女", "黑獸加迪", "空中商店・探險家", "幼獸加爾", "石精靈滾瓦", "地獄警官艾瑪", "角擊貓", "禍根魔女凱斯莉", "冥界神黑帝斯", "狙擊天才沙紀", "災難少女凱斯莉", "金太郎", "拉斯沃斯", "角龍格拉迪歐斯", "英雄令媛蜜斯", "成田甲斐", "影傑漆黑達太貓", "時空神克羅諾絲", "捲捲貓", "亡者偵探吳仲力", "貓咪鬥惡龍", "溫泉天堂・浴場隊", "雷精靈波特", "風隼櫻", "古龍剛格利昂", "幼傑達太貓", "黑無垢御靈", "風精靈艾爾", "水精靈密茲", "火精靈梅拉", "觀測兵器・探天隊", "雙掌星西兒＆小毬", "今川義元", "黑獸牙王", "猴蟹大戰貓", "巫女姬御靈", "海王神波塞頓", "飛空襲擊・轟炸隊", "古代軍船・戰槳隊", "帝國陸軍・石砲隊", "閃電機兵飛雷", "貓飯拳派派", "幼獸加歐", "不明貓", "踢腳貓", "頭槌貓", "手甩貓", "異能貓", "刺骨貓", "冰雪貓", "機器貓", "惡鬼喵魔", "巨劍騎士貓", "貓咪Baby", "貓護士", "真田幸村", "前田慶次", "織田信長", "伊達政宗", "武田信玄", "上杉謙信", "風神溫蒂", "雷神珊迪亞", "猿帝・悟空貓", "召喚・八戒貓", "寶杖使者・悟淨貓", "冥界卡莉法", "地龍索多姆", "聖龍梅基多拉", "龍騎士巴魯斯", "神龍卡姆庫拉", "龍戰機雷電", "霸龍迪歐拉姆斯", "浦島太郎", "白鶴貓", "桃太郎", "斗笠地藏", "輝夜姬", "咔嚓咔嚓山崽子", "阿激拉", "西園寺機器子", "貓俠大帝", "白兔女俠", "咒術師死亡小丑", "天誅飛隼", "天空神宙斯", "守護神阿努比斯", "美女神阿芙蘿黛蒂", "太陽神天照", "象頭神迦內薩"}, false}
        }, unitNameToId);

    banners["2024-08-26 ~ 2024-09-02: 新角色追加!來GET滿滿開放感的夏日限定角色吧!★點圖確認詳細吧!!"] = initBanner(
        {
            {7000, {"貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, false},
            {2500, {"遭洗腦的噁心貓", "遭洗腦的蜥蜴貓", "遭洗腦的巨神貓", "夏色萌萌貓", "日曬貓", "救生貓兄弟", "湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {500, {"夏日音樂祭珊迪亞", "熱帶卡莉法", "盛夏白兔女俠", "海漾狙擊天才沙紀", "陸海輝夜姬", "星光沙灘女莉莉"}, false}
        }, unitNameToId);

    banners["2024-09-06 ~ 2024-09-16: 來GET滿滿開放感的夏日限定角色吧!★點圖確認詳細吧!!"] = initBanner(
        {
            {7000, {"貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, false},
            {2500, {"遭洗腦的戰鬥貓", "遭洗腦的鳥貓", "遭洗腦的魚貓", "夏色萌萌貓", "日曬貓", "救生貓兄弟", "湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {500, {"常夏果實八戒貓", "灼熱海灘悟空貓", "潮風水手悟淨貓", "仲夏不明貓", "岸邊冒險家佳奈"}, false}
        }, unitNameToId);

    banners["2025-01-27 ~ 2025-02-03: 全新限定角色「幼天女露娜」參戰！★超激稀有出現率最大幅上升的特別轉蛋！"] = initBanner(
        {
            {6470, {"貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, true},
            {2500, {"貓咪七福神", "湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {1000, {"幼天女露娜", "特命交警阿酷賽爾", "開花爺爺", "噴火恐龍貓", "砲龍剛多羅斯", "炫幻傭兵特麗希", "明智光秀", "酷黑小小瓦爾基麗貓", "小小瓦爾基麗貓", "鐵籠的姵卡薩", "光翼神伊西絲", "鐵精靈卡卿", "建築兵團・運輸隊", "額頭貓", "非命之王佛挪", "閃電傑克", "一寸法師", "命運之子佛諾", "周遊藝團・雜耍隊", "天狗貓", "海龍達萊亞薩", "悲嘆揮舞孃", "冰精靈布莉茲", "服部半藏", "狩獵女孩媞倫", "墮天神路西法", "歡笑揮舞孃", "白騎士庫克洛普斯", "舌切雀", "超龍戰機・毀滅團", "闇精靈亞米", "怒髮貓", "邪龍赫維賈克", "妖賢女莉莉", "天草四郎", "召喚少年小悟", "黑獸加迪", "空中商店・探險家", "幼獸加爾", "石精靈滾瓦", "角擊貓", "禍根魔女凱斯莉", "冥界神黑帝斯", "狙擊天才沙紀", "災難少女凱斯莉", "金太郎", "拉斯沃斯", "角龍格拉迪歐斯", "英雄令媛蜜斯", "成田甲斐", "影傑漆黑達太貓", "時空神克羅諾絲", "捲捲貓", "亡者偵探吳仲力", "貓咪鬥惡龍", "溫泉天堂・浴場隊", "雷精靈波特", "古龍剛格利昂", "幼傑達太貓", "黑無垢御靈", "風精靈艾爾", "水精靈密茲", "火精靈梅拉", "觀測兵器・探天隊", "雙掌星西兒＆小毬", "今川義元", "黑獸牙王", "猴蟹大戰貓", "巫女姬御靈", "海王神波塞頓", "飛空襲擊・轟炸隊", "古代軍船・戰槳隊", "帝國陸軍・石砲隊", "象頭神迦內薩", "太陽神天照", "幼獸加歐", "天誅飛隼", "美女神阿芙蘿黛蒂", "守護神阿努比斯", "天空神宙斯", "刺骨貓", "咒術師死亡小丑", "白兔女俠", "咔嚓咔嚓山崽子", "貓俠大帝", "西園寺機器子", "阿激拉", "霸龍迪歐拉姆斯", "異能貓", "手甩貓", "頭槌貓", "踢腳貓", "冥界卡莉法", "上杉謙信", "貓護士", "輝夜姬", "斗笠地藏", "桃太郎", "白鶴貓", "浦島太郎", "武田信玄", "伊達政宗", "寶杖使者・悟淨貓", "召喚・八戒貓", "猿帝・悟空貓", "龍戰機雷電", "神龍卡姆庫拉", "龍騎士巴魯斯", "聖龍梅基多拉", "地龍索多姆", "雷神珊迪亞", "風神溫蒂", "織田信長", "前田慶次", "真田幸村", "貓咪Baby", "巨劍騎士貓", "惡鬼喵魔", "機器貓", "冰雪貓", "不明貓"}, false},
            {30, {"宵之伊邪那美", "曉之伊邪那岐"}, false}
        }, unitNameToId);

    banners["惡魔的完美新娘活動轉蛋"] = initBanner(
        {
            {800, {"5k XP"}, false},
            {5000, {"加速", "貓型電腦", "10k XP", "30k XP"}, true},
            {3000, {"土豪貓", "洞悉先機", "狙擊手", "100k XP"}, false},
            {1000, {"蛋N205", "蛋N203", "蛋N201"}, false},
            {200, {"1M XP"}, false}
        }, unitNameToId);

    banners["2025-04-24 ~ 2025-04-28: 新角色「戴天鬼」參戰！梅露可物語合作轉蛋登場！★點圖確認詳細吧!!"] = initBanner(
        {
            {7000, {"賽蕾絲", "諾諾", "奧爾加", "諾倫", "優依", "賽拉姆", "弗舞"}, true},
            {2500, {"奧爾托斯", "斯托魯伊悠", "阿洛伊斯", "阿烏拉", "雷伊"}, false},
            {500, {"戴天鬼", "艾沃茲", "留姬", "米希利亞", "米絲蒂卡", "悠凡斯", "可納莉亞", "哈爾修特", "飛翼龍"}, false},
        }, unitNameToId);

    banners["2025-06-04 ~ 2025-06-09: 共6位合作限定角色登場！★點圖確認詳細吧!!"] = initBanner(
        {
            {7000, {"貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, true},
            {2500, {"勇次郎貓", "湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {500, {"範馬刃牙", "烈海王", "花山薰", "愚地克巳", "傑克・範馬"}, false}
        }, unitNameToId);

    banners["2025-06-13 ~ 2025-06-16: 珍貴又夢幻的角色們在這！★超激稀有出現率超上升的「特級貓咪祭」進行中!!"] = initBanner(
        {
            {6470, {"貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, true},
            {2600, {"湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {900, {"眼擊貓", "特命交警阿酷賽爾", "開花爺爺", "噴火恐龍貓", "砲龍剛多羅斯", "明智光秀", "鐵籠的姵卡薩", "光翼神伊西絲", "鐵精靈卡卿", "建築兵團・運輸隊", "額頭貓", "非命之王佛挪", "閃電傑克", "一寸法師", "周遊藝團・雜耍隊", "天狗貓", "海龍達萊亞薩", "悲嘆揮舞孃", "冰精靈布莉茲", "服部半藏", "狩獵女孩媞倫", "墮天神路西法", "白騎士庫克洛普斯", "舌切雀", "超龍戰機・毀滅團", "闇精靈亞米", "怒髮貓", "邪龍赫維賈克", "妖賢女莉莉", "天草四郎", "召喚少年小悟", "黑獸加迪", "空中商店・探險家", "石精靈滾瓦", "角擊貓", "禍根魔女凱斯莉", "冥界神黑帝斯", "狙擊天才沙紀", "金太郎", "拉斯沃斯", "角龍格拉迪歐斯", "英雄令媛蜜斯", "成田甲斐", "影傑漆黑達太貓", "時空神克羅諾絲", "捲捲貓", "亡者偵探吳仲力", "貓咪鬥惡龍", "溫泉天堂・浴場隊", "雷精靈波特", "古龍剛格利昂", "黑無垢御靈", "風精靈艾爾", "水精靈密茲", "火精靈梅拉", "觀測兵器・探天隊", "雙掌星西兒＆小毬", "今川義元", "黑獸牙王", "猴蟹大戰貓", "海王神波塞頓", "飛空襲擊・轟炸隊", "古代軍船・戰槳隊", "帝國陸軍・石砲隊", "象頭神迦內薩", "太陽神天照", "不明貓", "冰雪貓", "機器貓", "惡鬼喵魔", "巨劍騎士貓", "貓咪Baby", "真田幸村", "前田慶次", "織田信長", "風神溫蒂", "雷神珊迪亞", "地龍索多姆", "聖龍梅基多拉", "龍騎士巴魯斯", "神龍卡姆庫拉", "龍戰機雷電", "猿帝・悟空貓", "召喚・八戒貓", "寶杖使者・悟淨貓", "伊達政宗", "武田信玄", "浦島太郎", "白鶴貓", "桃太郎", "斗笠地藏", "輝夜姬", "貓護士", "上杉謙信", "冥界卡莉法", "踢腳貓", "頭槌貓", "手甩貓", "異能貓", "霸龍迪歐拉姆斯", "阿激拉", "西園寺機器子", "貓俠大帝", "咔嚓咔嚓山崽子", "白兔女俠", "咒術師死亡小丑", "天誅飛隼", "刺骨貓", "天空神宙斯", "守護神阿努比斯", "美女神阿芙蘿黛蒂"}, false},
            {30, {"宵之伊邪那美"}, false}
        }, unitNameToId);*/

    banners[utf8_to_big5("2025-08-13 ~ 2025-08-18: 共有5位合作限定角色登場！★點圖確認詳細吧!!")] = initBanner(
        {
            {7000, {"夏特貓", "貓咪格鬥家", "鬥牛士貓", "貓咪探測器", "拳擊手貓", "樹剪貓", "貓咪陰陽師", "超能力貓", "人魚貓", "搖滾貓", "發條貓", "高蹺貓", "神槍手貓", "魔劍士貓", "弓箭手貓", "魔女貓", "薩滿貓", "占卜貓", "僧侶貓", "小偷貓", "海賊貓", "鬥士貓", "侏羅貓", "美容貓", "車輪貓", "跳跳貓"}, true},
            {2500, {"湖中女神貓", "擊劍貓", "業餘撐杆跳貓", "衝浪貓", "麵包機貓", "冰刀二人組", "舉重貓", "窗邊少女貓", "壽司貓", "浴缸貓", "蘋果貓", "快泳貓", "御宅貓", "暖桌貓", "放浪貓弟", "貓咪番長", "菩薩貓"}, false},
            {500, {"索尼克", "塔爾斯", "納克魯斯", "夏特"}, false}
        }, unitNameToId);

    return banners;
}
